In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df =pd.read_csv('data.csv')
df

    age  status
0    21     0.0
1    33     1.0
2    24     0.0
3    28     1.0
4    17     1.0
5    33     0.0
6    23     1.0
7    30     0.0
8    29     1.0
9    22     0.0
10   26     1.0
11   20     0.0
12   22     0.0
13   24     1.0
14   34     0.0
15   29     1.0
16   16     NaN
17   18     0.0
18   26     1.0
19   27     0.0

In [3]:
df.isnull().sum()

age       0
status    1
dtype: int64

In [4]:
handle = df['status'].median()
handle

0.0

In [5]:
df.status = df.status.fillna(handle)

In [6]:
df

    age  status
0    21     0.0
1    33     1.0
2    24     0.0
3    28     1.0
4    17     1.0
5    33     0.0
6    23     1.0
7    30     0.0
8    29     1.0
9    22     0.0
10   26     1.0
11   20     0.0
12   22     0.0
13   24     1.0
14   34     0.0
15   29     1.0
16   16     0.0
17   18     0.0
18   26     1.0
19   27     0.0

In [7]:
df['status'].value_counts()

0.0    11
1.0     9
Name: status, dtype: int64

In [8]:
x=df[['age']]
x

    age
0    21
1    33
2    24
3    28
4    17
5    33
6    23
7    30
8    29
9    22
10   26
11   20
12   22
13   24
14   34
15   29
16   16
17   18
18   26
19   27

In [9]:
y=df[['status']]
y

    status
0      0.0
1      1.0
2      0.0
3      1.0
4      1.0
5      0.0
6      1.0
7      0.0
8      1.0
9      0.0
10     1.0
11     0.0
12     0.0
13     1.0
14     0.0
15     1.0
16     0.0
17     0.0
18     1.0
19     0.0

In [10]:
from sklearn.model_selection import train_test_split

In [11]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=.30,random_state=1)

In [12]:
xtest

    age
3    28
16   16
6    23
10   26
2    24
14   34

In [13]:
ytest

    status
3      1.0
16     0.0
6      1.0
10     1.0
2      0.0
14     0.0

In [14]:
from sklearn.linear_model import LogisticRegression

In [15]:
model = LogisticRegression()

In [16]:
model.fit(xtrain,ytrain)

C:\Users\badhonkhan481\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression()

In [17]:
model.predict(xtest)

array([0., 0., 0., 0., 0., 1.])

In [18]:
#Accuracy
model.score(xtest,ytest)

0.3333333333333333

In [19]:
model.predict_proba(xtest)

array([[0.5119376 , 0.4880624 ],
       [0.74753114, 0.25246886],
       [0.61778244, 0.38221756],
       [0.55495564, 0.44504436],
       [0.59716562, 0.40283438],
       [0.38435478, 0.61564522]])